<a href="https://colab.research.google.com/github/IngridLaila/Conteudo_Didatico/blob/main/SQL/Comandos%20SQL.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## Nem todos os dias eu consigo, mas todos os dias eu tento
Autor desconhecido

## Criando e populando um novo banco de dados

In [ ]:
'''
Criar um banco de dados chamado loja

1 - Acesse Cloud SQL
2 - Crie uma instância com MySQL
3 - Pelo card da instância criada acesse o Shell
4 - Pelo shell conecte-se ao Mysql
5 - create database loja;
'''

'''
Agora vamos criar 6 tabelas e suas relações referentes a uma loja de utensílios
domésticos
tabelas: Cliente, Pedido, Produto, ItemPedido, Categoria, ProdutoCategoria

create table Cliente (
  id_cliente INT PRIMARY KEY,
  nome VARCHAR (50),
  endereco VARCHAR (100)
);

CREATE TABLE Pedido (
    id_pedido INT PRIMARY KEY,
    id_cliente INT,
    descricao VARCHAR(100),
    FOREIGN KEY (id_cliente) REFERENCES Cliente(id_cliente)
);

CREATE TABLE Produto (
    id_produto INT PRIMARY KEY,
    nome VARCHAR(50),
    preco DECIMAL(10, 2)
);

CREATE TABLE ItemPedido (
    id_item INT PRIMARY KEY,
    id_pedido INT,
    id_produto INT,
    quantidade INT,
    FOREIGN KEY (id_pedido) REFERENCES Pedido(id_pedido),
    FOREIGN KEY (id_produto) REFERENCES Produto(id_produto)
);

CREATE TABLE Categoria (
    id_categoria INT PRIMARY KEY,
    nome VARCHAR(50)
);

CREATE TABLE ProdutoCategoria (
    id_produto INT,
    id_categoria INT,
    PRIMARY KEY (id_produto, id_categoria),
    FOREIGN KEY (id_produto) REFERENCES Produto(id_produto),
    FOREIGN KEY (id_categoria) REFERENCES Categoria(id_categoria)
);
'''

In [ ]:
'''
Agora vamos popular as 6 tabelas com dados referentes a 20 transações comerciais
dessa loja
'''

'''
INSERT INTO Cliente (id_cliente, nome, endereco)
VALUES
    (1, 'Douglas', 'SP'),
    (2, 'Daniela', 'SP'),
    (3, 'Ester', 'MG'),
    (4, 'Maria', 'BA'),
    (5, 'Douglas', 'PE'),
    (6, 'Raimundo', 'CE'),
    (7, 'Jucimara', 'GO'),
    (8, 'Marlene', 'AC'),
    (9, 'Douglas', 'MA'),
    (10, 'Daniela', 'PI'),
    (11, 'Pedro', 'PB'),
    (12, 'Joaquim', 'RS'),
    (13, 'Julio', 'TO'),
    (14, 'Carla', 'DF'),
    (15, 'Bianca', 'PA'),
    (16, 'Sandra', 'SP'),
    (17, 'Celso', 'SP'),
    (18, 'Silvana', 'BA'),
    (19, 'Prof Raquel', 'BA'),
    (20, 'Pedro', 'SP');
'''
'''
INSERT INTO Pedido (id_pedido, id_cliente, descricao)
VALUES
    (1, '1', 'Caneca'),
    (2, '1', 'Garfo'),
    (3, '2', 'Faca'),
    (4, '5', 'Copo'),
    (5, '19', 'Copo'),
    (6, '19', 'Colher'),
    (7, '15', 'Colher'),
    (8, '8', 'Colher'),
    (9, '2', 'Copo'),
    (10, '19', 'Colher'),
    (11, '6', 'Copo'),
    (12, '11', 'Colher'),
    (13, '10', 'Garfo'),
    (14, '4', 'Garfo'),
    (15, '3', 'Colher'),
    (16, '3', 'Garfo'),
    (17, '2', 'Copo'),
    (18, '17', 'Garfo'),
    (19, '14', 'Caneca'),
    (20, '13', 'Caneca');
'''
'''
INSERT INTO Produto (id_produto, nome, preco)
VALUES
    (1, 'Caneca', 15.99),
    (2, 'Garfo', 5.99),
    (3, 'Faca', 7.99),
    (4, 'Colher', 3.99),
    (5, 'Copo', 10.99);
'''

'''
INSERT INTO ItemPedido (id_item, id_pedido, id_produto, quantidade)
VALUES
    (1, 1, 1, 2),
    (2, 2, 2, 5),
    (3, 3, 3, 7),
    (4, 4, 5, 10),
    (5, 5, 5, 11),
    (6, 6, 4, 30),
    (7, 7, 4, 32),
    (8, 8, 4, 44),
    (9, 9, 5, 13),
    (10, 10, 4, 33),
    (11, 11, 5, 34),
    (12, 12, 4, 32),
    (13, 13, 2, 33),
    (14, 14, 2, 34),
    (15, 15, 4, 27),
    (16, 16, 2, 18),
    (17, 17, 5, 17),
    (18, 18, 2, 33),
    (19, 19, 1, 50),
    (20, 20, 1, 47);
'''
'''
INSERT INTO Categoria (id_categoria, nome)
VALUES
    (1, 'Comer'),
    (2, 'Beber');

INSERT INTO ProdutoCategoria (id_produto, id_categoria)
VALUES
    (1, 2),
    (2, 1),
    (3, 1),
    (4, 1),
    (5, 2);
'''

## Agora vamos aprender os principais comandos de consulta para o Analista de Dados

## SELECT

In [ ]:
'''
colocar os selects * from para consulta de cada banco populado
'''
'''
-- seta o banco de dados, indica que usaremos o banco de dados loja
USE loja;

SELECT * FROM Cliente;
-- Lendo o comando: Seleciona todas as colunas da tabela: Cliente

SELECT * FROM Pedido;
-- Lendo o comando: Seleciona todas as colunas da tabela: Pedido

SELECT * FROM Produto;
-- Lendo o comando: Seleciona todas as colunas da tabela: Produto

SELECT * FROM ItemPedido;
-- Lendo o comando: Seleciona todas as colunas da tabela: ItemPedido

SELECT * FROM Categoria;
-- Lendo o comando: Seleciona todas as colunas da tabela: Categoria

SELECT * FROM ProdutoCategoria;
-- Lendo o comando: Seleciona todas as colunas da tabela: ProdutoCategoria

-- Warning: Evite o uso do *, seja específico, adicione apenas as colunas que irá precisar na sua análise.
-- Exemplo:
SELECT id_produto, quantidade FROM ItemPedido;

  Lendo o comando: Seleciona as colunas: id_produto e quantidade da tabela ItemPedido
'''

## WHERE — São as condições

In [ ]:
'''
SELECT id_produto, quantidade FROM ItemPedido
WHERE quantidade >= 10;
Lendo o comando: Seleciona as colunas: id_produto e quantidade da tabela: ItemPedido, quando a quantidade for maior ou igual a 10
'''

'''
SELECT * FROM Cliente
WHERE endereco = 'SP';

  Lendo o comando: Seleciona todas as colunas, quando o endereço for igual a SP
'''

## DISTINCT

In [ ]:
'''
SELECT distinct id_produto, quantidade FROM ItemPedido
WHERE quantidade >= 10;

  Lendo o comando: Seleciona distintamente as colunas: id_produto e quantidade da tabela: ItemPedido, quando o quando a quantidade for maior ou igual a 10.
'''

'''
SELECT distinct descricao FROM Pedido;

  Lendo o comando: Seleciona distintamente as colunas: id_produto e quantidade da tabela: ItemPedido, quando o quando a quantidade for maior ou igual a 10.
'''

'\nSELECT distinct descricao FROM Pedido;\n\n  Lendo o comando: Seleciona distintamente as colunas: id_produto e quantidade da tabela: ItemPedido, quando o quando a quantidade for maior ou igual a 10.\n'

## LIMIT — Retornar os n primeiros registros

In [ ]:
'''
SELECT * FROM Cliente
LIMIT 5;
  Lendo o comando: Seleciona todos os atributos da tabela Cliente e mostra
  apenas os cinco primeiros registros
'''

## BOOLEANOS ( E | OU | NÃO ) Bom para combinar com WHERE

In [ ]:
'''

-- Exemplo de AND
SELECT nome, endereco
FROM Cliente
WHERE endereco = 'BA'
AND id_cliente = 19;
Lendo o comando:
   Seleciona as colunas: nome e endereco da tabela: Clientes,
   apenas os registros com endereco igual a 'BA' e id_cliente igual a 19


-- Exemplo de OR
SELECT nome, endereco
FROM Cliente
WHERE endereco = 'SP'
OR endereco = 'MG';
Lendo o comando:
   Seleciona as colunas: nome e endereco da tabela: Clientes,
   apenas os registros com endereco igual a 'SP' ou endereco a 'MG'

-- Exemplo de NOT
SELECT nome, endereco
FROM Cliente
WHERE NOT endereco = 'SP';
Lendo o comando:
   Seleciona as colunas: nome e endereco da tabela: Clientes,
   apenas os registros com endereco não seja igual a 'SP'

## Funções de agregação ( SUM , AVG , MAX , MIN , COUNT e ROUND )

In [ ]:
'''
Somatório da quantidade de produtos vendidos

SELECT SUM(quantidade) AS soma_qtde
FROM ItemPedido;
'''

'''
Média da quantidade de produtos vendidos

SELECT AVG(quantidade) AS media_qtde,
round(AVG(quantidade),2) AS media_qtde_arredondado
FROM ItemPedido;
'''


'''
Maior quantidade de produtos vendidos

SELECT MAX(quantidade) AS maior_quantidade_venda
  FROM ItemPedido;
'''
'''
SELECT MIN(quantidade)  menor_quantidade_venda
  FROM ItemPedido;
'''

'''
Contagem de produtos (quantos produtos temos na nossa base?)

SELECT count(id_produto) as qtd_produtos
  FROM Produto;
'''